In [1]:
import pandas as pd

In [11]:

first_name = ['Jon','Mark','Maria','Jill','Jack']
series_first_name = pd.Series(first_name)
series_first_name

0      Jon
1     Mark
2    Maria
3     Jill
4     Jack
dtype: object

In [12]:
last_name = ['Anderson','Smith','Green','Miller','Carter']
series_last_name = pd.Series(last_name)
series_last_name

0    Anderson
1       Smith
2       Green
3      Miller
4      Carter
dtype: object

In [13]:
age = [23,57,42,35,29]
series_age = pd.Series(age)
series_age

0    23
1    57
2    42
3    35
4    29
dtype: int64

In [14]:
df_first_name = pd.DataFrame(series_first_name)
df_first_name = df_first_name.rename(columns = {0:'First Name'})
df_first_name

  First Name
0        Jon
1       Mark
2      Maria
3       Jill
4       Jack

In [17]:
df_last_name = pd.DataFrame(series_last_name)
df_last_name = df_last_name.rename(columns = {0:'Last Name'})
df_last_name

  Last Name
0  Anderson
1     Smith
2     Green
3    Miller
4    Carter

In [18]:
df_age = pd.DataFrame(series_age)
df_age = df_age.rename(columns = {0:'Age'})
df_age

   Age
0   23
1   57
2   42
3   35
4   29

In [19]:
df_all = pd.concat([df_first_name, df_last_name, df_age], axis=1)
df_all

  First Name Last Name  Age
0        Jon  Anderson   23
1       Mark     Smith   57
2      Maria     Green   42
3       Jill    Miller   35
4       Jack    Carter   29